{
  "MoMs - Event_Exhibitions": [
    [
      "Sr. No.",
      "Date",
      "Time",
      "Venue",
      "Name of Event",
      "Attended by (External)",
      "Attended by (Internal)",
      "Agenda",
      "Discussion Points",
      "Participants"
    ],
    [
      1,
      "10/01/2026 To 11/01/2026",
      "10:00 AM – 05:00 PM",
      null,
      "PM Vishwakarma Exhibition cum Trade Fair at Margao",
      null,
      "Yogesh Kumar (BFC)\r\nRoshan Jha (WEFC)",
      "To facilitate Udyam Registration during PM Vishwakarma Exhibition cum Trade Fair at Margao organised by MSME-DFO & DHTC for Goan Artisan, Handicrafts of State and to create awareness about Ecommerce plateform benefits, eligibility, and government support schemes.",
      "1.\tAwareness on Government of India Schemes and RAMP Programme\r\no\tBeneficiaries were provided detailed information about various central government schemes relevant to artisans and handicraft entrepreneurs.\r\no\tBriefly orientated about RAMP program and its BFC & WEFC functions.\r\no\tEligibility criteria, benefits, and application processes were explained in simple language.\r\n2.\tOrientation on ONDC (Open Network for Digital Commerce)\r\no\tThe concept, objectives, and significance of ONDC were explained.\r\no\tParticipants were oriented on how ONDC can enable wider market access, transparency, and digital inclusion for small producers and artisans.\r\n3.\tAwareness on GeM (Government e-Marketplace) Scheme\r\no\tThe importance and benefits of the GeM portal were discussed.\r\no\tArtisans were informed about opportunities to sell their products directly to government departments and PSUs through the platform.\r\n4.\tUdyam Registration Facilitation\r\no\tOn-the-spot support was provided for Udyam Registration of artisans and handicraft units.\r\no\tAssistance was also given for updating existing Udyam profiles to ensure compliance and access to scheme benefits.\r\n5.\tTEAM Portal Registration\r\no\tArtisans and handicraft beneficiaries were registered on the TEAM (Trade Enablement and Marketing) portal to enhance their digital presence and market linkage.",
      100
    ],
    [
      2,
      46037,
      "10:00 AM – 06:30 PM",
      null,
      "WEFC Training (Integrated Support for Women -led MSMEs in Goa)",
      null,
      "Nikita Kumari (WEFC)\r\nShreya Naik (WEFC)\r\nMegha Dalal (BFC)\r\nNeha N Shetgaoncar (PA)",
      "Awareness on WEFC/BFC services, Udyam Registration, and TEAM Initiative registration",
      "• We presented briefly on RAMP, BFC/WEFC, ONDC, UDYAM, and Several women specific schemes.\r\n•Networking and interactions were undertaken with the participating MSMEs.\r\n• Pamphlets and informational material related to RAMP, BFC, WEFC, PMEGP, PMFME, Exports, and ZED Certification were distributed to participants.\r\n• On-the-spot brief consultations were conducted with existing and aspiring MSMEs.\r\n• Onsite Udyam and Teams Initiative Registrations were done.\r\n• MSMEs were advised to visit the DITC–BFC/WEFC office for detailed discussions and solution-oriented follow-up meetings.\r\n"
    ],
    [
      3,
      46034,
      "02:00 AM – 07:30 PM",
      null,
      "GOA MSME ADHIVESHAN 3.0",
      null,
      "Nikita Kumari (WEFC) Megha Dalal (BFC)  Jatin Gahlot (WEFC)",
      "Awareness on WEFC/BFC services, Udyam Registration, and TEAM Initiative registration",
      "• Networking and interactions were undertaken with officials from various departments and participating MSMEs. • Pamphlets and informational material related to RAMP, BFC, WEFC, PMEGP, PMFME, Exports, and ZED Certification were distributed to participants. • On-the-spot brief consultations were conducted with 21 MSMEs from sectors such as garments, gas manufacturing, electronic panel board manufacturing, dried fish processing, and allied activities. • MSMEs were advised to visit the DITC–BFC/WEFC office for detailed discussions and solution-oriented follow-up meetings."
    ],
    [
      4,
      46030,
      "10:00 AM – 03:30 PM",
      null,
      "National Seminar/Workshop on MSMEs Empowerment",
      null,
      "Nikita Kumari (WEFC) Mayuri Patil (BFC) Pradip Nagargoje (BFC) Megha Dalal (BFC) Navyateja Cheerladinne (BFC)",
      "Awareness on WEFC/BFC services and consultations",
      "• The team made a presentation on the RAMP project, Business Facilitation Cell (BFC), and Women Export Facilitation Cell (WEFC). • Networking and interactions were undertaken with DFO officials and participating MSMEs. • Pamphlets related to RAMP, BFC, WEFC, Exports, and ZED Certification were distributed to participants."
    ],
    [
      5,
      46021,
      "10:00 AM - 05:00 PM",
      "Nerul",
      "Udyam Registrations Drive - Nerul",
      "CRP DRDA - Nerul",
      "Sanket Desai (BFC)\r\nPradip Nagargoje (BFC)",
      "To facilitate Udyam Registration for SHG members of Nerul village and to create awareness about its benefits, eligibility, and government support schemes.",
      "• Total 35 Udyam registration completed and 37 SHG mebers are facilitated\r\n• Facilitation and completion of Udyam Registration for SHG members\r\n• Explanation of the importance and benefits of Udyam Registration for formalization and access to government schemes\r\n• Discussion on ONDC and ongoing team initiatives for market linkage and digital enablement\r\n• Overview of the role and support services of BFC and WEFC in handholding, capacity building, and enterprise development for SHG members\r\n",
      37,
      null,
      null,
      "• Pamphlets related to RAMP, BFC, WEFC, Exports, and ZED Certification were distributed to participants."
    ],
    [
      6,
      46013,
      "10:00 AM - 05:00 PM",
      "Mapusa",
      "PM Vishwakarma Exhibition - Mapusa",
      "MSME-DFO  ",
      "Sanket Desai (BFC) \r\nSmitha Raikar (WEFC) \r\nShreyas Raikar (BFC) \r\nJatin Gahlot (WEFC)\r\n",
      "To facilitate PM Vishwakarma beneficiaries with ONDC onboarding, TEAM portal registrations, and provide awareness on RAMP initiatives including BFC and WEFC",
      "• Participants: 50 (Male 11, Female 39)\r\n• Registrations: Udyam – 6, TEAM/ONDC – Data of 22 interested participants was collected offline as the TEAM website server was temporarily down\r\n• Sessions Held:\r\n      RAMP Programme\r\n      Role of BFC & WEFC teams\r\n      ONDC/TEAM Initiative\r\n      Information related to Government schemes\r\n      Udyam Registrations\r\n• Support Provided: Interested Participants added to WhatsApp group for future communication and query resolutions\r\n• Challenge: TEAM website server was temporarily down\r\n• Overall high participation, strong engagement from women entrepreneurs; smooth facilitation despite challenges\r\n",
      50
    ],
    [
      7,
      46006,
      "10:00 AM - 05:00 PM",
      "Moira",
      "Moira Udyam registration drive",
      "BM Livelihood Bardez block",
      "Sanket Desai (BFC) \r\nRoshan Jha (WEFC)\r\n",
      "To facilitate Udyam Registration for SHG members of Moira village and to create awareness about its benefits, eligibility, and government support schemes.",
      "• Total 19 Udyam registration completed\r\n• Facilitation and completion of Udyam Registration for SHG members\r\n• Explanation of the importance and benefits of Udyam Registration for formalization and access to government schemes\r\n• Discussion on ONDC and ongoing team initiatives for market linkage and digital enablement\r\n• Overview of the role and support services of BFC and WEFC in handholding, capacity building, and enterprise development for SHG members\r\n",
      19
    ],
    [
      8,
      45999,
      "10:00 AM – 03:00 PM",
      "Trimurti Hall, Mapusa",
      "PM Vishwakarma Awareness Workshop",
      "MSME-DFO and DHTC",
      "Yogesh Kumar (BFC) Sanket Desai (BFC)   Pradip Nagargoje (BFC) Shreyash Raikar (BFC)",
      "Conducted session on TEAM initiative and ONDC with Artisans and Handicrafts of Goa. Detailed overview of RAMP programme. Udyam registration and TEAM portal registration",
      "• Registrations: Udyam – 5, TEAM/ONDC – 2                                                                                                                                                       • Sessions Held:                                                                                                                                                                                           MSME DFO: PM Vishwakarma, PMFME, PMEGP, PMS, Udyam process                                                                                • BFC Team: TEAM Initiative, ONDC, E-commerce market access                                                                                                      • Support Provided:                                                                                                                                                                   Interested participants added to WhatsApp group for follow-up                                                                                                   Challenges:                                                                                                                                                                                                                                                                                                                                                                 • Challenges:\r\n Incorrect Udyam certificates                                                                                                                                                                                                                                                                                                                                                      Lack of mobile phones                                                                                                                                                                          Missing documents                                                                                                                                                                              Portal/website errors                                                                                                                                                                      • Additional Info Shared:                                                                                                                                                                         RAMP Programme                                                                                                                                                                               Role of BFC & WEFC teams                                                                                                                                                                  • Overall:                                                                                                                                                                                              High participation, strong engagement from women entrepreneurs; smooth facilitation despite challenges.",
      " 100                                         (Male 11, Female 89)"
    ],
    [
      9,
      45996,
      "03:00 AM – 05:00 PM",
      "Pissurlem IDC",
      "Energy Water Audit Workshop Pissurlem",
      null,
      "Ferdin Sylvester (BFC) Megha Dalal (BFC)                                     ",
      "Meeting and support for MSMEs attending Energy and Water audit workshop under RAMP conducted by IIT Bombay at Pissurlem IDC.",
      "• The team visited MSME engagement workshop on Energy and Water audit conducted by IIT Bombay under RAMP.                                                                                                                                                                                                            • Participants were given a PPT brief on RAMP, BFC, and support for MSMEs. They were informed to come to DITC office for further support under RAMP.                                                                                                                                              • MSMEs are interested in visiting DITC office for further support.                                                                                                  • Team visited the unit of ‘Omni Impex’, a MSME, to understand scope of energy and water audit."
    ],
    [
      10,
      45996,
      "10:00 AM – 12:00 PM",
      "Madkai IDC",
      "Energy Water Audit Workshop Madkai",
      "Mr. Soham K, Madkai IDC President",
      "Ferdin Sylvester (BFC)                                                       Megha Dalal (BFC)",
      "Meeting and support for MSMEs attending Energy and Water audit workshop under RAMP conducted by IIT Bombay at Madkai IDC",
      "• The team visited MSME engagement workshop on Energy and Water audit conducted by IIT Bombay under RAMP. \r\n• Discussion and strategy planning on outreach to implement audits for MSMEs was conducted along with IIT Bombay team.\r\n• Participants were given a PPT brief on RAMP, BFC, and support for MSMEs. They were informed to come to DITC office for further support under RAMP.\r\n• Meeting was done with Mr. Soham K, Madkai IDC President, on conducting another RAMP workshop for all MSMEs at his IDC\r\n"
    ],
    [
      11,
      45995,
      "3:00 PM – 5:00 PM",
      "Thivim Industrial Estates",
      "Water & Energy Audit workshop Thivim",
      null,
      "Yogesh Kumar (BFC)                                                           Sanket Desai (BFC)",
      "Attended Water & Energy Audit workshop at Thivim Industrial Estates",
      "• IIT Ropar and Madras Team conducted the session on water and energy audit.                                                                                                                                             • Shared information of scheme benefits with attendees.                                                                                                                       • We BFC team Monitored and Observed the event and shared the pamphlets of RAMP. Discussed about functioning of BFC and WEFC. ",
      2
    ],
    [
      12,
      45995,
      "11:00 AM – 1:00 PM",
      "Colvale Industrial Estates",
      "Water & Energy Audit workshop Colvale",
      null,
      "Yogesh Kumar (BFC)                                                         Sanket Desai (BFC)",
      "Attended Water & Energy Audit workshop at Colvale Industrial Estates",
      "• IIT Ropar and Madras Team conducted the session on water and energy audit.                                                                                                                                                                • Shared information of scheme benefits with attendees.                                                                                                                       • We BFC team Monitored and Observed the event and shared the pamphlets of RAMP. Discussed about functioning of BFC and WEFC",
      2
    ],
    [
      13,
      45993,
      "10:00 AM – 5:00 PM",
      "Art and Culture Department, Patto Panaji",
      "CRP & SHG Workshop",
      null,
      "Ferdin Sylvester (BFC)                                                                                                      Megha Dalal (BFC)                                                                Sanket Desai (BFC)                                                                                 Jatin Gahlot (WEFC)                                                                 Yogesh Kumar (BFC)                                                          Roshan Jha (WEFC)                                                                 Shreyash Raikar (BFC)                                                            Smitha Raikar (WEFC)                                                            Shreya Naik (WEFC)                                                                Samiksha Chodankar (BFC)",
      "Conducted Workshop with CRPs and SHGs ",
      "• To create awareness among SHGs and CRPs about the RAMP Program, roles and functioning of BFC & WEFC, and to facilitate Udyam and TEAM (ONDC) registrations.                                                                                                         Sessions Conducted\r\n• RAMP Program Overview - Facilitator: Ferdin\r\n• BFC & WEFC – Roles and Functioning - Facilitator: Samiksha\r\n• Udyam Registration Process - Facilitator: Sanket\r\n• TEAM Initiative & ONDC Awareness - Facilitator: Yogesh\r\nKey Activities\r\n• Conducted structured awareness sessions for SHGs and CRPs on government initiatives and market access platforms.\r\n• Explained step-by-step processes for Udyam and TEAM (ONDC) registration.\r\n• Addressed participant queries related to eligibility, documentation, and benefits.\r\nPost-Session Support\r\n• Addressed Q&As of Participants.\r\n• Facilitated Udyam Registration for eligible participants.\r\n• Completed TEAM (ONDC) registrations for participants interested in digital and e-commerce market access.                                                                                                                                                    Outcome\r\n• Improved awareness among SHGs and CRPs regarding MSME-related schemes and support systems.\r\n• Onboarded participants onto Udyam and TEAM (ONDC) platforms for future handholding and market linkage support.\r\n\r\n"
    ],
    [
      14,
      45982,
      "10:00 AM – 5:00 PM",
      "Cidade De Goa",
      "Net Zero Event",
      null,
      "Ferdin Sylvester (BFC)\r\nMegha Dalal (BFC)\r\nSanket Desai (BFC)\r\nJatin Gahlot (WEFC)\r\n",
      "Attended NetZero Event hosted by Goa Climate Change Cell",
      "• The team visited the international stakeholder engagement and workshop on Net Zero through conservation and livelihood enhancement conducted by government of Goa and climate change cell. \r\n• The BFC team showcased ongoing initiatives under RAMP and UMBRELLA schemes, focusing on MSME support and sustainability awareness."
    ],
    [
      15,
      45981,
      "12:00 AM to 4:00 PM",
      "South Goa",
      "Jute Macrame Training (St. Joans)",
      null,
      "Roshan Jha (BFC)\r\nShreyas Raikar (BFC)\r\nYogesh Kumar (BFC)\r\n",
      "Awareness on WEFC/BFC services, Udyam Registration, and TEAM Initiative registration",
      "• Brief on RAMP, BFC/WEFC teams under the Directorate of Industries, Trade and Commerce, along with awareness generation about our presence at Udyog Bhavan, Panaji                                                                                                                                                                                                                                                                                  • Circulated Ramp and BFC/WEFC by DITC pamphlets among the all                                                                                                                                                                                                                                 • Awareness about Central and State Scheme"
    ],
    [
      16,
      45980,
      "11:00 AM to 4:00 PM",
      null,
      "Food Processing Training (St. Joans)",
      null,
      "Roshan Jha (BFC)\r\nShreyas Raikar (BFC)\r\n",
      "Awareness on WEFC/BFC services, Udyam Registration, and TEAM Initiative registration",
      "• Brief on RAMP, BFC/WEFC teams under the Directorate of Industries, Trade and Commerce, along with awareness generation about our presence at Udyog Bhavan, Panaji                                                                                                                           • Circulated Ramp and BFC/WEFC by DITC pamphlets among the all                                                                                       • Awareness about Central and State Scheme",
      43
    ],
    [
      17,
      45979,
      "10:00 AM to 4:00 PM",
      "Grace Church Hall Pajifond Margao, South Goa",
      "PM Vishwakarma Awareness Program",
      null,
      "Smitha Raikar (WEFC)\r\nSamiksha chodankar (BFC)\r\nShreyash Raikar (BFC)\r\n",
      "Awareness and training for PM Vishwakarma-registered artisans and entrepreneurs. Focused on Marketing & Entrepreneurship Orientation for certificate holders and new applicants.\r\n\r\n",
      "• Brief on RAMP, BFC/WEFC teams under the Directorate of Industries, Trade and Commerce, along with awareness generation about our presence at Udyog Bhavan, Panaji.                                                                                                                              • Circulated Ramp and BFC/WEFC by DITC pamphlets among the all.                                                                                                    • One-on-one discussion with DFO officials regarding coordination and future collaboration.                                                                   • Discussion on upcoming training and seminars announced by DFO Margao for November and 2025.                                       • WEFC to participate in upcoming PM Vishwakarma exhibitions/trade fairs in December and we have requested to provide a staff for us to represent DITC.                                                                                                                                                     • Maintain continued engagement with SHG Trainers for mobilization and women entrepreneur participation."
    ],
    [
      18,
      45972,
      "11:00 PM TO 5:00 PM ",
      null,
      "PM Vishwakarma Awareness Program",
      null,
      "Smitha Raikar (WEFC)\r\nSamiksha Chodankar (BFC)\r\nMayuri Patil (BFC)\r\nShreyash Raikar (BFC)\r\n",
      "Awareness and training for PM Vishwakarma-registered artisans and entrepreneurs. Focused on Marketing & Entrepreneurship Orientation for certificate holders and new applicants.\r\n",
      "• Identify clusters for mobilization from South Goa under PM Vishwakarma.                                                                                           • Continue coordination with DFO Margao for mobilization and awareness activities.                                                                             • DITC/WEFC to participate in upcoming PM Vishwakarma exhibitions/trade fairs in December.                                                        • Share details of future programs (Training & Seminars) with MSME and SHG groups.                                                                 • Maintain continued engagement with SHG Trainers for mobilization and women entrepreneur participation."
    ],
    [
      19,
      45967,
      "11:00 PM To 2:00 PM",
      "Porvorim ",
      "Swayampoorna Sakhi Training, Goa",
      null,
      "Sanket Desai (BFC)\r\nFerdin Sylvester (BFC)\r\n",
      "Understand the training structure and content for CRP cadre.",
      "• Capacity Building Initiatives.                                                                                                                                                                                                                                                                                                                            • The CRP cadre underwent training in six key areas: Mathematics, Business Plan Format, Working Capital Term Loan, Compound Interest, Market & Technical Analysis, License & Registration.                                                                                                                                                                                                                  • Operational Hierarchy and Field Challenges.                                                                                                                                                                                                                                 • The BM outlined the operational hierarchy at block level and CRP training modules. o Discussion highlighted limited awareness of government compliance, insufficient scheme information, and the need for inter department coordination.                                                                                • Recommendations for Support.                                                                                                                                                                                                                                                                             • BM and BPM requested to have a separate workshop for only BM/BPMs with support in FSSAI – FDA, Udyam, NOCs (especially health), GST, financial awareness and schemes. o It would be optimum to have members from FSSAI and health department as part of this workshop so they can also help address the challenges the block level staff face. "
    ],
    [
      20,
      45966,
      "03:00 PM – 07:00 PM",
      null,
      "Cost & Competitiveness of MSMEs in India",
      null,
      "Smitha Raikar (WEFC)\r\nNikita Kumari (WEFC)\r\nRoshan Jha (WEFC)\r\nPradip Nagargoje (BFC)\r\nShreya Naik (WEFC)\r\n",
      "RAMP, BFC & WEFC awareness",
      "• Challenges faced by shipbuilding and cluster-based industries.                                                                                                                                                                                                                                               • Requirement for improved Ease of Doing Business (EoDB).                                                                                                                                                                                                                                                              • Need for Single Window Clearances for licenses and approvals.                                                                                                                                                                                                                                                   • The Ministry of MSME is conducting a comprehensive study to identify grassroot-level challenges and develop interventions aimed at reducing costs and improving MSME competitiveness across India.                                                                                                                                                                                                                                                                                    • Overview of Major MSME Schemes by SIDBI like MSE -SPICE and MSE - GIFT"
    ],
    [
      21,
      45947,
      "03:00 PM – 07:30 PM",
      "Don Bosco Panaji",
      "Tarang Exhibition",
      null,
      "Manasi Kowadkar (BFC)\r\nMayuri Patil (BFC)\r\nShreya Naik (WEFC)\r\nShreyash Raikar (BFC)\r\nRoshan Jha (WFEC)\r\nSanket Desai(BFC)\r\n",
      "To assess the requirements and support needs of MSMEs participating in various exhibitions and events, and to explore collaboration opportunities with Tarang event organizers.",
      "• Discussion with Participant Regarding their Online Business  Interest, Aware them about Udyam Registration, ONDC, MSME schemes and RAMP Program.\r\nChallenges:\r\n• Udyam certificates\r\n• Lack of mobile phones\r\n• Missing documents\r\nOverall:\r\n• High participation, strong interest came from women entrepreneurs.\r\n",
      "150                                                                             (Male 40, Female 110)"
    ],
    [],
    [],
    [],
    []
  ],
  " MoMs - departmental visits": [
    [
      "Sr. No.",
      "Date",
      "Time",
      "Venue",
      "Name of Event",
      "Attended by (External)",
      "Attended by (Internal)",
      "Agenda",
      "Discussion Points"
    ],
    [
      1,
      46035,
      "03:30 PM – 05:00 PM",
      "Thivim",
      "Thivim IDC",
      null,
      "Sanket Desai\r\nFerdin Sylvester",
      "Planning a 5-day dedicated helpdesk at Thivim IDC for MSME support under the RAMP program.\r\n•\tConfirm timelines, promotion, and data strategies.\r\n•\tAlign on helpdesk dates and pre-event preparations.\r\n•\tAddress MSME pain points for targeted support.",
      "The IDC President endorsed the helpdesk, appreciating RAMP's role in MSME growth. Discussion and agreement reached on pre-event data collection and joint execution.\r\nHelpdesk Dates: Proposed and agreed: February 2nd to 6th, 2026 (11 AM – 4:30 PM daily).\r\nPlanning and Notification: Finalize plans and notify stakeholders 8 days prior via email/SMS.\r\nPromotion: Install ads on both gates and canteens one week prior (by January 26, 2026).\r\nPre-Event Data Collection: Circulate Google Form 10 days prior to gather MSME info on pain points, problems, schemes needed, and linkages.\r\nLinkage Data: Compile forward/backward linkage data during helpdesk via surveys.\r\nMail detailed Agenda and Plan of Action (PoA) to IDC President for approval."
    ],
    [
      2,
      46002,
      "11:00 AM – 12:00 PM",
      "Patto Panaji",
      "GEDA",
      "Ms. Saina P. Shirodkar, Technical Assistant, GEDA",
      "Ferdin Sylvester                   Megha Dalal                      Nithin K.",
      "Discuss ongoing and upcoming initiatives, and to explore potential areas of collaboration for RAMP, BFC, and WEFC activities",
      "Introduction\r\nA meeting was held with Ms. Saina P. Shirodkar, Technical Assistant at GEDA, to discuss ongoing and upcoming initiatives, and to explore potential areas of collaboration for RAMP, BFC, and WEFC activities.\r\n\r\nKey Discussion Points\r\n•RAMP, BFC, and WEFC Presence\r\nWe briefed Ms. Shirodkar on the scope and presence of RAMP, BFC, and WEFC in Goa and explored opportunities for integration with GEDA’s initiatives.\r\n•Pilot Projects in Selected Panchayats\r\nGEDA is planning pilot interventions in three panchayats—Calangute, Cacra, and Haverlem panchayat.\r\nThe objective is to assess current local initiatives and identify how GEDA and partnering entities can support and enhance these efforts.\r\n•GIZ Energy Roadmap – Phase II\r\nMs. Shirodkar informed us that GIZ has completed Phase I of the Energy Roadmap for Goa, which was launched at the G20 Summit in 2023.\r\nPhase II will now focus on implementing the roadmap, including:\r\n• Pilot implementation in the three identified panchayats\r\n• Promotion of green cooking solutions\r\n• Electrification and support for tribal hostels\r\n• Development of a bioenergy policy\r\n• Expansion of solar energy initiatives\r\n• Other renewable and sustainable energy actions\r\n•Deployment of FMC – MSME Cluster Personnel\r\nGEDA has appointed 5–6 personnel through FMC – MSME Cluster to work full-time with the three pilot panchayats for one year.\r\nTheir mandate includes demonstrating tangible improvements and measurable outcomes within the project duration.\r\n•E-Boat and Fishing Sector Electrification Initiative\r\nGEDA is developing a roadmap for the electrification of fishing boats (e-boats) through retrofitting.\r\nThis initiative is being undertaken in collaboration with a NABARD-associated entity from Kerala.\r\nA detailed survey and study will be conducted, following which a pilot project will be launched. Charging infrastructure will also be planned as part of this initiative.\r\n•Proposed Competition for Women SHG Groups\r\nGEDA is planning to launch a competition for women Self-Help Groups (SHGs) to propose business ideas that incorporate an energy-based component.\r\n• Two winning SHGs will be selected.\r\n• Each winner will be awarded ₹12.5 lakh as prize funding to establish or scale their proposed business.\r\n•Collaboration with GIZ on SHG conversation Models\r\nGEDA, in association with GIZ, is working on a model for the conversing of SHG groups.\r\nGEDA will serve as the nodal agency for this initiative.\r\nA similar model has already been successfully implemented in Punjab.\r\n"
    ],
    [
      3,
      45989,
      "2:00 PM to 4:00 PM",
      null,
      "Software Technology Parks of India (STPI)",
      null,
      "Pradip Nagargoje (BFC)\r\nSmita Raikar (WEFC)\r\nMayuri Patil (BFC)\r\n",
      "To understanding the facilities, services, and technical support offered by STPI to MSMEs, IT/ITES units, and exporters. It also included exploring collaboration opportunities in technology adoption, digital enablement, and export readiness. Additionally, the purpose was to gather relevant data and information required for departmental reporting, planning, and future MSME support initiatives",
      "• STPI provided an overview of its core services, including incubation facilities, advanced IT infrastructure, and high-speed connectivity support.\r\n• Officials explained the foreign exchange earnings mechanism related to STPI-registered units.\r\n• STPI informed about the availability of structured databases containing information on IT/ITES units operating under STPI Goa.\r\n• Opportunities for MSMEs to adopt digital platforms and benefit from training, workshops, and awareness programs were highlighted.\r\n• Possible collaboration areas were discussed, including joint awareness sessions, participation in MSME promotional events, and support for technology-driven entrepreneurs under the BFC–WEFC–RAMP program.\r\n"
    ],
    [
      4,
      45986,
      "02:00 PM To 4:00 PM",
      null,
      "Department of HANDICRAFTS, TEXTILE & COIR",
      "Director Mr. Shagun R. Velip Sir & PM Vishwakarma Team Lead Mr. Mahim Prasad Sahu",
      "Shreyas Raikar (BFC)\r\n Yogesh. Kumar (BFC)\r\n",
      "Discussion about RAMP (BFC & WEFC functioning) TEAM Initiative & ONDC",
      "• Met with Director Mr. Shagun R. Velip Sir & PM Vishwakarma Team Lead Mr. Mahim Prasad Sahu (+91-9778720381)\r\n Brief about RAMP, BFC, WEFC and share pamphlets with sir.\r\n Explained the concept, benefits, and implementation approach of the TEAM Initiative and ONDC.\r\n Director Sir expressed interest and mentioned that their team supports MSMEs through training/guidance.\r\n Conducted a short presentation in the conference hall on ONDC & TEAM for their officials.\r\n• Queries Raised by Directorate Team\r\n Availability of ONDC success stories from Goa.\r\n SNPs (Seller Network Partners) specific to artisans and handicrafts.\r\n Availability of statistical data to measure MSME growth.\r\n Possibility of organizing a physical orientation workshop for MSMEs; they are open to sharing MSME data if required.\r\n• Action Points\r\n Share ONDC success stories and relevant SNP list.\r\n Provide MSME growth-related statistical insights.\r\n Plan for a physical MSME orientation workshop in coordination with Director’s team.\r\n"
    ],
    [
      5,
      45986,
      "11:00 PM to 11:30 PM",
      null,
      "World Trade Centre (WTC) Goa",
      null,
      "Sanket Desai (BFC)\r\nJatin Gahlot (WEFC)\r\n",
      "To brief Mr. Cyril about the RAMP Programme and the role of BFC & WEFC. To discuss collaboration opportunities between WTC and BFC/WEFC for MSME support.",
      "• Meeting was convened to explore collaboration opportunities between the Directorate of Industries, Trade and Commerce (DITC) and the World Trade Centre (WTC) Goa.\r\n• Mr. Cyril D’Souza provided an overview of the global operations of WTC, comprising over 300 centres across 100 countries.\r\n• It was informed that WTC Goa currently has a network of around 60 MSMEs and works in coordination with the MSME Development and Facilitation Office (DFO) to conduct Udyam registration camps.\r\n• The discussion included details of the WTC Mumbai event, where MSMEs are provided stall space through collaboration with DRDA.\r\n• WTC Goa expressed willingness to collaborate with DITC, however, requested the signing of an MoU to outline the scope of partnership and mutual benefits.\r\n"
    ],
    [
      6,
      45985,
      "4:30 PM to 5:00 PM",
      null,
      "DRDA Livelihood team",
      null,
      "Megha Dalal (BFC)\r\nFardin Sylvester (BFC)\r\n",
      "Brief GWMC on RAMP, SPICE, and GIFT\r\nExplore how to bring MSME’s in waste management sector onto the green schemes\r\n",
      "• BFC & WEFC team explained their role across finance, business, legal, export, IT, ESG and compliance domains.\r\n• Discussed collaborative efforts to assist MSMEs for waste management sector.\r\n• Suggested Contacts for Meetings \r\n• Mr. Prashid Naik, Deputy Director of Panchayat\r\n• Mr. Sachin Ambe, CCP\r\n• Mr. Mujavar, GSUDA\r\n• It was also mentioned that 14 Urban Local Bodies (ULBs) and ~190 panchayats could benefit from the SPICE Scheme\r\n"
    ],
    [
      7,
      45978,
      "11:00 AM to 1:00 PM",
      "DRDA office",
      "DRDA Livelihood team",
      null,
      "Sanket Desai (BFC)\r\nFerdin Sylvester (BFC)\r\nSamiksha Chodankar (BFC) \r\nSmita Raikar (WEFC)\r\nMayuri Patil (BFC)\r\n",
      "To brief DRDA livelihood team about the RAMP Programme and the role of BFC & WEFC.\r\nTo discuss collaboration opportunities between DRDA and BFC/WEFC for MSME support.\r\nTo identify on-ground challenges faced by MSMEs and SHG-based enterprises.\r\nTo understand specific support required from BFC & WEFC to strengthen livelihood initiatives\r\n",
      "• BFC & WEFC team explained their role across finance, business, legal, export, IT, ESG and compliance domains.\r\n• Discussed collaborative efforts to assist MSMEs and SHGs through awareness, guidance, and training.\r\n• DRDA team highlighted key challenges:\r\n• Difficulties in NOC, FSSAI, and trade registrations due to property ownership issues.\r\n• Limited awareness about schemes, ONDC, and GeM.\r\n• Raw material shortage issues & procurement issues\r\n• Most SHGs are involved in tailoring, papad/snacks making, catering, handicrafts, masala production, and candles & agarbatti making.\r\n• Requested BFC & WEFC support for branding, packaging, labelling, ONDC/GeM sessions, and licensing guidance.\r\n• Discussed the role of social media marketing to enhance MSME visibility.\r\n• WhatsApp coordination group was created with DRDA and BFC/WEFC teams for smooth communication.\r\n"
    ],
    [
      8,
      45975,
      "11:00 PM To 1:00 PM",
      null,
      "Export Inspection Agency",
      null,
      "Pradip Nagargoje (BFC)\r\nMayuri Patil (BFC)\r\n",
      "To understand the inspection processes, certification procedures, audit mechanisms, and exporter support services provided by the Export Inspection Agency (EIA), and to explore opportunities for collaboration in awareness and training programs.",
      "• Department to issue a formal email to the Export Inspection Agency requesting permission for participation in their online awareness webinars.\r\n• Follow-up coordination to be maintained with Shri Shripadrao Revankar for updates on inspection procedures, certifications, and exporter support activities.\r\n• Opportunity identified for collaboration in conducting exporter awareness and MSME support programs in alignment with departmental objectives.\r\n• Documentation and insights shared during the visit to be used for strengthening field-level engagement and improving exporter outreach.\r\n"
    ],
    [
      9,
      45975,
      "2:00 PM To 4:00 PM",
      null,
      "KVIC, GOA",
      null,
      "Pradip Nagargoje (BFC)\r\nManasi Kowadkar (BFC)\r\n",
      "Awareness and Outreach Activities",
      "• We conducted an awareness interaction about RAMP, BFC, and WEFC and explained their purpose and benefits.\r\n• We enquired with the team regarding upcoming events and activities planned by the department.\r\n• We also requested them to share the latest MSME data for further coordination and reference.\r\n• The officials briefed us about the schemes available under their department and explained the various benefits offered to MSMEs.\r\n"
    ],
    [
      10,
      45975,
      0.6666666666666666,
      null,
      "Labour & Employment Department",
      "Mr. Prasad Govekar Assistant Labour Commissioner:      \r\n\r\n",
      "Megha Dalal (BFC)\r\nJatin Gahlot (WEFC)\r\n",
      "Introduction of RAMP program and introduction of BFC & WEFC team\r\nDiscussion on upcoming events and departmental activities for collaboration\r\n",
      "• Establish communication protocol with the department for regular updates.\r\n• Facilitate Udyam registration support for shop owners.\r\n• Collaborate on promotion of MSME-related schemes and activities.\r\n• Explained the importance and process of Udyam Registration for shop owners.\r\n• Discussion on promoting government schemes, subsidies, and MSME support initiatives.\r\n"
    ],
    [
      11,
      45974,
      0.9166666666666666,
      null,
      "EDC and EDII",
      null,
      "Manasi Kowadkar (BFC)\r\nSamiksha Chodankar (BFC)\r\nShreya Naik (WEFC)\r\n",
      "To know about upcoming events and workshops they are planning in which we can participate",
      "• It was discussed that the information shared during the meeting—such as upcoming training opportunities, programme schedules, and MSME support requirements—will help strengthen our involvement in training and capacity-building activities. This includes directing MSMEs to EDC’s EDP programmes, and other workshops, where we can interact, network, and support them with Udyam registrations and other eligibility-based services. • The EDII team will inform us about their upcoming training programs, and we can participate in them as per relevance. •\tCoordination will be maintained with the EDC team to facilitate MSME loan-related support whenever required. \r\nThis includes guidance and linkages for schemes such as CMRY, the Mukhya Mantri Modified Interest Rebate Scheme, General Term Loans, GTEGP, and other EDC financial assistance programmes."
    ],
    [
      12,
      45973,
      "3:00 PM TO 5:00 PM",
      null,
      "Goa Pollution Control Board (GPCB)",
      null,
      "Megha Dalal (BFC)\r\nFerdin Sylvester (BFC)\r\n",
      "Introduction of RAMP team to Goa Pollution Control Board (GPCB), getting information on upcoming events and activities of GPCB for collaboration opportunities.",
      "• It was decided to send an email containing the details of BFC (Business Facilitation Centre) and WEFC (Women Entrepreneurship Facilitation Centre). This information will be forwarded to GPCB so that they can share it with MSME \r\n• Establish communication protocol with department to regularly share suitable events, initiatives, and collaboration opportunities.\r\n• Discussion was held on collaborating with GPCB to promote government schemes, subsidies, and support initiatives available for MSMEs.\r\n"
    ],
    [
      13,
      45972,
      "3:00 PM TO 5:00 PM",
      null,
      "Confederation of Indian Industry Goa",
      null,
      "Manashi Kowadkar (BFC)\r\nYogesh Kumar (BFC)\r\n",
      "For Team Initiative (ONDC Registration) of 500 MSMEs.\r\nFor Introductory Meeting about RAMP-BFC&WEFC\r\nTo know about upcoming events and workshops they are planning in which we can participate \r\nVisited 2 places NSIC office CII Fountainhas\r\n",
      "• The team initially visited the NSIC office but could not locate it at the listed address. The visit was then redirected to the CII Goa office.\r\n• A brief introduction was given about our team and our initiatives to support MSMEs through various schemes and programs.\r\n• CII shared that they primarily work with small and medium enterprises and have a database of approximately 3,000 MSMEs from GIDC, though only a few are currently active. Their main focus areas include facilitating loans, private equity connections, and B2B meetings.\r\n• Detailed discussion held with Mr. Sagar Chatterjee regarding their ongoing initiatives and upcoming MSME-focused events.\r\n• CII is planning a session on logistics for MSMEs tentatively on 15 November 2025, which may be postponed to January 2026.\r\n• An Annual Day event is scheduled for March 2026.\r\n• They are also planning sessions on Tourism Opportunities and Packaging, which are under finalization.\r\n• A proposed event on AI incorporation in machine manufacturing and robotics is being planned for April or May 2026 (yet to be finalized).\r\n• CII requested information on government schemes related to R&D or funding support for shipyard manufacturing vendors.\r\n• We briefed them on the TEAM initiative and ONDC platform. Mr. Chatterjee mentioned that any MSME approaching them for ONDC onboarding would be referred to our team.\r\n• He also requested a catalogue of available MSME schemes and BFC & WEFC details in PDF format to circulate within their MSME group.\r\n"
    ],
    [
      14,
      45971,
      "3:00 PM TO 5:00 PM",
      null,
      "Goa State Biodiversity Board (GSBB)",
      null,
      "Megha Dalal (BFC)\r\nFerdin Sylvester (BFC)\r\nJatin Gahlot (WEFC)\r\n",
      "Introduction of RAMP team to Goa State Biodiversity Board (GSBB), getting information on upcoming events and activities of GSBB for collaboration opportunities.",
      "• Coordinate with the GSBB to establish schedule for periodic sessions at the identified Multi Product Processing centres for outreach, Standees, collaterals.\r\n• We had discussion for Green Shield Goa and Climate Disaster Resistant Greening goa.\r\n• Introduction of Blended Finance for climate and biodiversity projects — first-of-its-kind in Goa and across India.\r\n• Discussed with her at ‘Net zero Conference’ for potential collaboration on climate-related projects and they asked us to join in that summit to represent ourself and the schemes.\r\n• Establish communication protocol with department to regularly share suitable events, initiatives, and collaboration opportunities.\r\n• Prepare and disseminate detailed information on GIFT and SPICE schemes to MSMEs through GSBB events and activities.\r\n"
    ],
    [
      15,
      45968,
      "11:00 PM To 1:00 PM",
      null,
      "Directorate of Fisheries, Goa",
      null,
      "Pradip Nagargoje (BFC)\r\nMayuri Patil (BFC\r\n",
      "To understand the functioning and key activities of the Directorate of Fisheries, Government of Goa, including their operational structure, ongoing initiatives, and event management processes, and to explore opportunities for collaboration and participation in upcoming fisheries- related programs under the RAMP framework.",
      "• The Directorate briefed about departmental functions, welfare schemes, and event coordination activities across various jetties in Goa.\r\n• The Superintendent will be the main point of contact for information on upcoming fisheries events and participation procedures.\r\n• Opportunities identified for collaboration with BFC and WEFC teams in awareness, training, and business linkage programs related to the marine and allied sectors.\r\n• Plan to participate in forthcoming departmental events and introduce the objectives of BFC and WEFC among fishermen and local stakeholders. Coordination to continue for field-level engagement and promotion of MSME-related services under the RAMP framework.\r\n"
    ],
    [
      16,
      45965,
      "11:00 AM – 12:00 PM",
      null,
      "District Rural Development Association Goa",
      null,
      "Sanket Desai (BFC)\r\nFerdin Sylvester (BFC) \r\nJatin Gahlot (WEFC)\r\n",
      "Explain RAMP goals and project overview to all CRPs. Detailed overview of RAMP project. Different verticals and stakeholders working under RAMP. Point of Contact (PoC) from RAMP team for CRPs based on work scope \r\nEnhance CRPs' capability to effectively contribute to RAMP project goals.\r\nProvide training on critical tasks including: Udyam onboarding procession (Open Network for Digital Commerce) onboarding. Scheme overview and related documentation.\r\n",
      "• DRDA has committed to provide two dedicated staff members for the RAMP project: DRDA will actively support in mobilizing the Community Resource Persons (CRPs) across both regions.\r\n• Workshop Scale Total CRPs to be trained: 180 Workshop format: One-day intensive workshop Training approach: Trainer-of-Trainer’s style\r\n• Proposed venue: Directorate of Art and Culture, Goa (selected for accessibility across the state) Current status: Auditorium fully booked for November 2025 Available dates in December 2025: 2nd, 3rd, and 13th.Tentative date: December 2, 2025 (subject to final confirmation).\r\n"
    ],
    [
      17,
      45959,
      "3:00 PM To 6:00 PM",
      null,
      "MSME DFO Office",
      null,
      "Smitha Raikar (WEFC)\r\nNikita Kumari (WEFC)\r\nYogesh Kumar (BFC)\r\n",
      "Participation in MSME Programs\r\nAwareness and Outreach Activities\r\n",
      "• Dedicated time slots will be allocated for BFC/WEFC to interact with MSMEs during such programs.\r\n• The teams may present MSME -TEAM initiative and introduce the ONDC (Open Network for Digital Commerce) platform.\r\n• Support for Udyam Registration can also be provided on-site during these events.\r\n• He also shared details of the upcoming events organized by the MoMSME and DFO, encouraging participation from BFC and WEFC representatives:\r\n• 5th November: GCCI Cost & Competitiveness Workshop\r\n• 11th November: PM Vishwakarma and IPR-related Program\r\n• 29th November: Women-Centric Program for 100 Udyam Registration at Hotel Orzo, Margao Goa.\r\n"
    ]
  ]
}